shraddha-koli/Psoc-5/Pressure sensor/VoltageDisplay_SAR_ADC.cydsn/codegentemp/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.2
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2018 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice.h"
#include "cydevice_trm.h"
#include "CyScBoostClk.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "VoltInput_aliases.h"
#include "VoltInput.h"
#include "LCD.h"
#include "ADC.h"
#include "mySCL_aliases.h"
#include "mySCL.h"
#include "mySDA_aliases.h"
#include "mySDA.h"
#include "Counter_1.h"
#include "P0_4_aliases.h"
#include "P0_4.h"
#include "P0_5_aliases.h"
#include "P0_5.h"
#include "CharLCD_1.h"
#include "CounterISR.h"
#include "clock_2.h"
#include "Pin_1_aliases.h"
#include "Pin_1.h"
#include "LCD_LCDPort_aliases.h"
#include "LCD_LCDPort.h"
#include "ADC_IRQ.h"
#include "ADC_theACLK.h"
#include "CharLCD_1_LCDPort_aliases.h"
#include "CharLCD_1_LCDPort.h"
#include "cy_em_eeprom.h"
#include "core_cm3_psoc5.h"
#include "CyDmac.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cypins.h"
#include "cyPm.h"
#include "CySpc.h"
#include "cytypes.h"

/*[]*/

